espressif/esp-idf/components/soc/esp32s3/include/soc/efuse_struct.h
            uint32_t rd_key2_err_num:       3;     /*The value of this signal means the number of error bytes.*/
            uint32_t rd_key2_fail:          1;     /*0: Means no failure and that the data of key$n is reliable 1: Means that programming key$n failed and the number of error bytes is over 6.*/
            uint32_t rd_key3_err_num:       3;     /*The value of this signal means the number of error bytes.*/
            uint32_t rd_key3_fail:          1;     /*0: Means no failure and that the data of key$n is reliable 1: Means that programming key$n failed and the number of error bytes is over 6.*/
            uint32_t rd_key4_err_num:       3;     /*The value of this signal means the number of error bytes.*/
            uint32_t rd_key4_fail:          1;     /*0: Means no failure and that the data of key$n is reliable 1: Means that programming key$n failed and the number of error bytes is over 6.*/
        };
        uint32_t val;
    } rd_rs_err0;
    union {
        struct {
            uint32_t rd_key5_err_num:   3;         /*The value of this signal means the number of error bytes.*/
            uint32_t rd_key5_fail:      1;         /*0: Means no failure and that the data of KEY5 is reliable 1: Means that programming user data failed and the number of error bytes is over 6.*/
            uint32_t rd_sys_part2_num:  3;         /*The value of this signal means the number of error bytes.*/
            uint32_t rd_sys_part2_fail: 1;         /*0: Means no failure and that the data of system part2 is reliable 1: Means that programming user data failed and the number of error bytes is over 6.*/
            uint32_t reserved8:        24;         /*Reserved.*/
        };
        uint32_t val;
    } rd_rs_err1;
    union {
        struct {
            uint32_t mem_force_pd:     1;          /*Set this bit to force eFuse SRAM into power-saving mode.*/
            uint32_t mem_clk_force_on: 1;          /*Set this bit and force to activate clock signal of eFuse SRAM.*/
            uint32_t mem_force_pu:     1;          /*Set this bit to force eFuse SRAM into working mode.*/
            uint32_t reserved3:       13;          /*Reserved.*/
            uint32_t clk_en:           1;          /*Set this bit and force to enable clock signal of eFuse memory.*/
            uint32_t reserved17:      15;          /*Reserved.*/
        };
        uint32_t val;
    } clk;
    union {
        struct {
            uint32_t op_code:   16;                /*0x5A5A: Operate programming command 0x5AA5: Operate read command.*/
            uint32_t reserved16: 16;               /*Reserved.*/
        };
        uint32_t val;
    } conf;
    union {
        struct {
            uint32_t state:            4;          /*Indicates the state of the eFuse state machine.*/
            uint32_t otp_load_sw:      1;          /*The value of OTP_LOAD_SW.*/
            uint32_t otp_vddq_c_sync2: 1;          /*The value of OTP_VDDQ_C_SYNC2.*/
            uint32_t otp_strobe_sw:    1;          /*The value of OTP_STROBE_SW.*/
            uint32_t otp_csb_sw:       1;          /*The value of OTP_CSB_SW.*/
            uint32_t otp_pgenb_sw:     1;          /*The value of OTP_PGENB_SW.*/
            uint32_t otp_vddq_is_sw:   1;          /*The value of OTP_VDDQ_IS_SW.*/
            uint32_t repeat_err_cnt:   8;          /*Indicates the number of error bits during programming BLOCK0.*/
            uint32_t reserved18:      14;          /*Reserved.*/
        };
        uint32_t val;
    } status;
    union {
        struct {
            uint32_t read_cmd:   1;                /*Set this bit to send read command.*/
            uint32_t pgm_cmd:    1;                /*Set this bit to send programming command.*/
            uint32_t blk_num:    4;                /*The serial number of the block to be programmed. Value 0-10 corresponds to block number 0-10  respectively.*/
            uint32_t reserved6: 26;                /*Reserved.*/
        };
        uint32_t val;
    } cmd;
    union {
        struct {
            uint32_t read_done:         1;         /*The raw bit signal for read_done interrupt.*/
            uint32_t pgm_done:          1;         /*The raw bit signal for pgm_done interrupt.*/
            uint32_t reserved2:        30;         /*Reserved.*/
        };
        uint32_t val;
    } int_raw;
    union {
        struct {
            uint32_t read_done:        1;          /*The status signal for read_done interrupt.*/
            uint32_t pgm_done:         1;          /*The status signal for pgm_done interrupt.*/
            uint32_t reserved2:       30;          /*Reserved.*/
        };
        uint32_t val;
    } int_st;
    union {
        struct {
            uint32_t read_done:         1;         /*The enable signal for read_done interrupt.*/
            uint32_t pgm_done:          1;         /*The enable signal for pgm_done interrupt.*/
            uint32_t reserved2:        30;         /*Reserved.*/
        };
        uint32_t val;
    } int_ena;
    union {
        struct {
            uint32_t read_done:         1;         /*The clear signal for read_done interrupt.*/
            uint32_t pgm_done:          1;         /*The clear signal for pgm_done interrupt.*/
            uint32_t reserved2:        30;         /*Reserved.*/
        };
        uint32_t val;
    } int_clr;
    union {
        struct {
            uint32_t dac_clk_div:     8;           /*Controls the division factor of the rising clock of the programming voltage.*/
            uint32_t dac_clk_pad_sel: 1;           /*Don't care.*/
            uint32_t dac_num:         8;           /*Controls the rising period of the programming voltage.*/
            uint32_t oe_clr:          1;           /*Reduces the power supply of the programming voltage.*/
            uint32_t reserved18:     14;           /*Reserved.*/
        };
        uint32_t val;
    } dac_conf;
    union {
        struct {
            uint32_t reserved0                     :    24;  /*Reserved. (Default read timing parameter)*/
            uint32_t reg_read_init_num             :    8;  /*Configures the initial read time of eFuse.*/
        };
        uint32_t val;
    } rd_tim_conf;
    uint32_t wr_tim_conf0;
    union {
        struct {
            uint32_t tsup_a:     8;                /*Configures the setup time of programming operation.*/
            uint32_t pwr_on_num: 16;               /*Configures the power up time for VDDQ.*/
            uint32_t reserved24: 8;                /*Reserved.*/
        };
        uint32_t val;
    } wr_tim_conf1;
    union {
        struct {
            uint32_t pwr_off_num: 16;              /*Configures the power outage time for VDDQ.*/
            uint32_t reserved16: 16;               /*Reserved.*/
        };
        uint32_t val;
    } wr_tim_conf2;
    union {
        struct {
            uint32_t date:      28;                /*Stores eFuse version.*/
            uint32_t reserved28: 4;                /*Reserved.*/
        };
        uint32_t val;
    } date;
} efuse_dev_t;

extern efuse_dev_t EFUSE;

#ifdef __cplusplus
}
#endif



#endif /*_SOC_EFUSE_STRUCT_H_ */
